app/Controllers/Barang.php

            $fileFoto->move('img', $namaFoto);
        }

        $this->barangModel->save([
            'nama_barang' => $this->request->getVar('nama_barang'),
            'jumlah_barang' => $this->request->getVar('jumlah_barang'),
            'harga_barang' => $this->request->getVar('harga_barang'),
            'id_kategori' => $this->request->getVar('id_kategori'),
            'foto' => $namaFoto

        ]);
---
INSERT INTO `barang` (`nama_barang`, `jumlah_barang`, `harga_barang`, `id_kategori`, `foto`) VALUES ('gfdhfd', '43', '4325353', '2', 'default-barang.png')

            // hapus file nama
            unlink('img/' . $this->request->getVar('oldfoto'));
        }
        $this->barangModel->save([
            'id_barang' => $id_barang,
            'nama_barang' => $this->request->getVar('nama_barang'),
            'jumlah_barang' => $this->request->getVar('jumlah_barang'),
            'harga_barang' => $this->request->getVar('harga_barang'),
            'id_kategori' => $this->request->getVar('id_kategori'),
            'foto' => $namaFoto


        ]);
---
UPDATE `barang` SET `nama_barang` = 'Pod caliburn', `jumlah_barang` = '893', `harga_barang` = '500000234', `id_kategori` = '2', `foto` = '1690431852_c416d57cf25517f08263.jpg'
WHERE `barang`.`id_barang` IN ('3')