app/Models/BarangModel.php

SELECT *
FROM `barang`
---
    public function getBarang($id_barang = false)
    {
        if ($id_barang == false) {
            return $this->findAll();

SELECT *
FROM `barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
---
    public function joinBarang($id_barang = false)
    {
        if ($id_barang == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('barang');
            $builder->select('*');
            $builder->join('kategori', 'kategori.id_kategori = barang.id_kategori');
            $query = $builder->get();

SELECT COUNT(*) AS `numrows`
FROM `barang`
---
    public function hitungBarang()
    {
        $db = \Config\Database::connect();
        $query = $db->table('barang');
        $query->selectCount('id_barang');
        $result = $query->countAllResults();