app/Models/DetailModel.php

SELECT *
FROM `detail_transaksi`
JOIN `transaksi` ON `transaksi`.`id_transaksi` = `detail_transaksi`.`id_transaksi`
JOIN `barang` ON `barang`.`id_barang` = `detail_transaksi`.`id_barang`
JOIN `kategori` ON `kategori`.`id_kategori` = `barang`.`id_kategori`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
JOIN `pembayaran` ON `pembayaran`.`id_pembayaran` = `transaksi`.`id_pembayaran`
WHERE `detail_transaksi`.`id_transaksi` = '7'
---
    public function joinDetailTransaksiBulan($bulan, $tahun)
    {
        $db      = \Config\Database::connect();
        $builder = $db->table('detail_transaksi');
        $builder->join('transaksi', 'transaksi.id_transaksi = detail_transaksi.id_transaksi');
        $builder->join('barang', 'barang.id_barang = detail_transaksi.id_barang');
        $builder->join('kategori', 'kategori.id_kategori = barang.id_kategori');
        $builder->join('user', 'user.id_user = transaksi.id_user');
        $builder->join('pembayaran', 'pembayaran.id_pembayaran = transaksi.id_pembayaran');
        $builder->where('MONTH(transaksi.tgl)', $bulan);
        $builder->where('YEAR(transaksi.tgl)', $tahun);
        $query = $builder->get();