app/Models/KategoriModel.php

    public function getKategori($id_kategori = false)
    {
        if ($id_kategori == false) {
            return $this->findAll();
---
SELECT *
FROM `kategori`

    public function hitungKategori()
    {
        $db = \Config\Database::connect();
        $query = $db->table('kategori');
        $query->selectCount('id_kategori');
        $result = $query->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `kategori`