app/Models/PembayaranModel.php

SELECT *
FROM `pembayaran`
---
    public function getPembayaran($id_pembayaran = false)
    {
        if ($id_pembayaran == false) {
            return $this->findAll();

SELECT COUNT(*) AS `numrows`
FROM `pembayaran`
---
    public function hitungPembayaran()
    {
        $db = \Config\Database::connect();
        $query = $db->table('pembayaran');
        $query->selectCount('id_pembayaran');
        $result = $query->countAllResults();