app/Models/TransaksiModel.php

SELECT *
FROM `transaksi`
SELECT *
FROM `transaksi`
WHERE `id_transaksi` = '7'
 LIMIT 1
---
    public function getTransaksi($id_transaksi = false)
    {
        if ($id_transaksi == false) {
            return $this->findAll();
        }
        return $this->where(['id_transaksi' => $id_transaksi])->first();

SELECT COUNT(*) AS `numrows`
FROM `transaksi`
---
    public function hitungTransaksi()
    {
        $db = \Config\Database::connect();
        $query = $db->table('transaksi');
        $query->selectCount('id_transaksi');
        $result = $query->countAllResults();

SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
JOIN `pembayaran` ON `pembayaran`.`id_pembayaran` = `transaksi`.`id_pembayaran`
SELECT *
FROM `transaksi`
JOIN `user` ON `user`.`id_user` = `transaksi`.`id_user`
JOIN `pembayaran` ON `pembayaran`.`id_pembayaran` = `transaksi`.`id_pembayaran`
WHERE `id_transaksi` = '7'
---
    public function joinTransaksi($id_transaksi = false)
    {
        if ($id_transaksi == false) {
            $db      = \Config\Database::connect();
            $builder = $db->table('transaksi');
            $builder->select('*');

            $builder->join('user', 'user.id_user = transaksi.id_user');
            $builder->join('pembayaran', 'pembayaran.id_pembayaran = transaksi.id_pembayaran');
            $query = $builder->get();
            return $query->getResultArray();
        }
        $db      = \Config\Database::connect();
        $builder = $db->table('transaksi');
        $builder->select('*');

        $builder->join('user', 'user.id_user = transaksi.id_user');
        $builder->join('pembayaran', 'pembayaran.id_pembayaran = transaksi.id_pembayaran');
        $builder->where('id_transaksi', $id_transaksi);
        $query = $builder->get();