app/Models/UserModel.php

SELECT *
FROM `user`
SELECT *
FROM `user`
WHERE `id_user` = '1'
 LIMIT 1
---
    public function getUser($id_user = false)
    {
        if ($id_user == false) {
            return $this->findAll();
        }
        return $this->where(['id_user' => $id_user])->first();

SELECT COUNT(*) AS `numrows`
FROM `user`
---
    public function hitungUsers()
    {
        $db = \Config\Database::connect();
        $query = $db->table('user');
        $query->selectCount('id_user');
        $result = $query->countAllResults();